Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_insurance_prsi/homemakers_scheme.html.txt.tmx
Source language: en
Languages: ga

source: The Homemaker's Scheme makes it easier for a homemaker to qualify for the State Pension (Contributory)
ga: Is scéim í an Scéim um Chúramaí Baile a dhéanann éascaíocht do dhéantóir baile cáiliú don Phinsean Stáit (Ranníocach)

source: A homemaker, for the purposes of the Homemaker’s Scheme (which was introduced from 6 April 1994), is a man or woman who provides full-time care for a child under age 12 or an ill or disabled person aged 12 or over
ga: Faoin Scéim um Chúramaí Baile (a thugadh isteach ó 6 Aibreán 1994) is déantóir baile é ná fear nó bean a thugann aire lánaimseartha do leanbh faoi aois 12 bliain nó leanbh/duine fásta éagumasach aois 12 bliain nó os a chionn

source: Under the Homemaker's Scheme any years that you spent as a homemaker (since 6 April 1994) are ignored or disregarded when working out your yearly average contributions for a State Pension (Contributory)
ga: Déantar neamhaird ar aon bhliain a chaith tú sa bhaile agus do mheánranníocaíochtaí in aghaidh na bliana á oibriú amach do Phinsean Stáit (Ranníocaíocht)

source: To be eligible, you must:
ga: Chun a bheith incháilithe don Scéim um Chúramaí Baile, caithfidh:

source: • Permanently live in the State (except in cases where provisions under EU or posted worker regulations apply)
ga: • Tú a bheith i do chónaí sa Stát go buan (seachas i gcásanna a bhaineann le forálacha rialacháin AE nó oibrithe sannta)

source: • Be aged under 66
ga: • Tú a bheith faoi 66 bliain d'aois

source: • Have started insurable employment or self-employment on or after the age of 16 and before the age of 56
ga: • Go raibh tú i bhfostaíocht/féin-fhostaithe inárachais (i.e., caithfidh tú a bheith faoi árachas ar nó tar éis aois 16 agus roimh aois 56 bliain)

source: • Not work full-time, however, you can work and earn less than €38 gross per week
ga: • Tú gan a bheith gafa le fostaíocht lánaimseartha, tá cead agat áfach oibriú agus níos lú ná 38 euro sa tseachtain a shaothrú

source: • Care full-time for a child under 12 or an ill or disabled person
ga: • Tú a bheith ag tabhairt cúraim do leanbh faoi 12 bliana d'aois nó duine éagumasach ar bhonn lánaimseartha

source: Before 26 October 2000, you were required to live with the person you were caring for
ga: Roimh an 26 Deireadh Fómhair 2000, ní mór go raibh cónaí ort freisin leis an duine atá faoi do chúram

source: Since 26 October 2000, if you are not living with this person:
ga: Ón 26 Deireadh Fómhair 2000, mura bhfuil cónaí ort leis an duine sin:

source: • A direct system of communication must exist between your home and the person being cared for, for example by telephone or alarm system and
ga: • Caithfidh córas díreach cumarsáide a bheith idir do theach agus an duine atá faoi do chúram, mar shampla trí theileafón nó córas aláraim agus

source: • The person being cared for must not be getting full-time care and attention within their own home from anyone else
ga: • Ní féidir leis an duine atá faoi do chúram cúram agus aird lánaimseartha a bheith acu cheana féin ó dhuine ar bith eile ina dteach féin

source: The person being cared for must be so disabled or incapacitated as to need:
ga: Caithfidh an duine a bhfuil an cúram dhá fháil aige/aici a bheith chomh míchumasach nó éagumasach agus go dteastaíonn:

source: • Continuous supervision in order to avoid danger to himself or herself
ga: • Maoirseacht leanúnach chun contúirt a sheachaint dó nó di féin

source: • Continuous supervision and frequent assistance throughout the day in connection with his or her normal personal needs
ga: • Maoirseacht leanúnach agus cúnamh rialta tríd an lá maidir lena mbaineann dá c(h)uid gnáth riachtanais phearsanta

source: It's important to note that only one person can be regarded as the homemaker at any one time
ga: Tá sé tábhachtach a thabhairt faoi deara nach mbreathnaítear ar níos mó ná duine amháin mar Chúramaí baile ag am ar bith

source: If you stop being a homemaker and your spouse or civil partner takes up homemaking duties, you should notify the Department immediately to ensure there is no loss of entitlements under the Homemaker's Scheme
ga: Má stopadh tú ag obair mar Chúramaí Baile agus má ghlacann do chéile/páirtnéir sibhialta dualgais na gcúraimí baile orthu féin, ba chóir duit fógra a thabhairt don Roinn láithreach chun cinntiú nach gcailltear teidlíochtaí ar bith faoin scéim do Chúramaí Baile

source: A homemaking year is a year in which you are out of the workforce for the full tax year (only a full year can be disregarded)
ga: Is bliain í an bhliain cúramaíochta baile ina bhfuil tú amuigh as an bhfórsa-oibre ar feadh na bliana ranníocaíochta iomláin

source: Up to a maximum of 20 homemaking years can be disregarded for State Pension (Contributory) purposes
ga: Is féidir neamhaird a dhéanamh ar 20 bliain ar a mhéid caite mar chúramaí baile maidir le Pinsean Stáit (Ranníocach)

source: Homemaker’s credits can be awarded for part of a year at the start of the homemaking period, from the date you become a homemaker up to the end of the tax year
ga: Tugtar creidmheasanna cúramaíochta baile suas go deireadh na bliana ranníocaíochta inár thosaigh duine a bheith ina chúramaí baile

source: Likewise, homemaker’s credits can also be awarded for part of a year when the homemaking period ends, from the start of the tax year up to the date you stop homemaking
ga: Má éiríonn duine as a bheith ina c(h)úramaí baile le linn na bliana ranníocaíochta, déantar creidmheasanna cúramaíochta baile a thabhairt suas go dtí an dáta sin

source: Registering as a homemaker
ga: Clárú mar Chúramaí Baile

source: You should register before the end of the contribution year after the year in which you first become a homemaker
ga: Ba chóir duit clárú roimh dheireadh na bliana ranníocaíochta tar éis na bliana inár thosaigh tú a bheith i do chúramaí baile, m.sh., má thosaigh tú mar chúramaí baile sa tréimhse í 2013, ba chóir duit clárú roimh an 31 Nollaig 2014

source: To register fill out the Homemaker's form (HM1) (pdf)
ga: Líonadh amach fhoirm chlárúcháin HM1 (pdf)

source: You do not need to register if you:
ga: Ná gá duit clárú má tá:

source: • Are getting Carer's Allowance, Carer's Benefit or the Carer's Support Grant
ga: • Liúntas Cúramóra, Sochar Cúramóra nó Deontas Cúraim Faoisimh dhá íoc leat

source: • Are getting Child Benefit and are providing the child(ren) with full-time care
ga: • Sochar Linbh dhá íoc leat agus má tá tú ag cuir cúraim lánaimseartha ar fáil do na leanaí/leanbh

source: You do not need to register because your claim for Child Benefit, Carer's Allowance, Carer's Benefit or the Carer's Support Grant is treated as an application to be registered as a homemaker
ga: Níl gá duit clárú mar caithfear le d'éileamh ar Shochar Linbh, ar Liúntas Cúramóra, ar Shochar Cúramóra nó ar Dheontas Cúraim Faoisimh mar iarratas ar d'ainm a chlárú mar Chúramaí Baile
